bdrr77/azurertos-efx32/netxduo_port/nx_driver_efm32gg11b.c
/****** DRIVER SPECIFIC ****** Start of part/vendor specific internal driver functions.  */


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_initialize                    STM32F7xx/IAR     */ 
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific initialization.           */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    driver_req_ptr                        Driver request pointer        */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    ETH_BSP_Config                        Configure Ethernet            */ 
/*    ETH_MACAddressConfig                  Setup MAC address             */ 
/*    ETH_DMARxDescReceiveITConfig          Enable receive descriptors    */ 
/*    nx_packet_allocate                    Allocate receive packet(s)    */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    _nx_driver_initialize                 Driver initialize processing  */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
static UINT  _nx_driver_hardware_initialize(NX_IP_DRIVER *driver_req_ptr)
{

NX_PACKET           *packet_ptr;
UINT                i;
uint32_t address;

    /* Default to successful return.  */
    driver_req_ptr -> nx_ip_driver_status =  NX_SUCCESS;

    /* Setup indices.  */
    nx_driver_information.nx_driver_information_receive_current_index = 0; 
    nx_driver_information.nx_driver_information_transmit_current_index = 0; 
    nx_driver_information.nx_driver_information_transmit_release_index = 0;

    /* Clear the number of buffers in use counter.  */
    nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use = 0;

    /* Make sure there are receive packets... otherwise, return an error.  */
    if (nx_driver_information.nx_driver_information_packet_pool_ptr == NULL)
    {
    
        /* There must be receive packets. If not, return an error!  */
        return(NX_DRIVER_ERROR);
    }

    //Enable GPIO clock
    CMU_ClockEnable(cmuClock_GPIO, true);
    //Enable external oscillator
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);
  
    //Select CMU_CLK2 clock source
    CMU->CTRL |= CMU_CTRL_CLKOUTSEL2_HFXO;
  
    //Configure CMU_CLK2 (PD10)
    GPIO_PinModeSet(gpioPortD, 10, gpioModePushPull, 0);
    //Remap CMU_CLK2 pin
    CMU->ROUTELOC0 = (CMU->ROUTELOC0 & ~_CMU_ROUTELOC0_CLKOUT2LOC_MASK) | CMU_ROUTELOC0_CLKOUT2LOC_LOC5;
    //Enable CMU_CLK2 pin
    CMU->ROUTEPEN |= CMU_ROUTEPEN_CLKOUT2PEN;
  
    //Select RMII operation mode and enable transceiver clock
    ETH->CTRL = ETH_CTRL_GBLCLKEN | ETH_CTRL_MIISEL_RMII;
  
    //Configure ETH_RMII_TXD0 (PF7)
    GPIO_PinModeSet(gpioPortF, 7, gpioModePushPull, 0);
  
    //Configure ETH_RMII_TXD1 (PF6)
    GPIO_PinModeSet(gpioPortF, 6, gpioModePushPull, 0);
  
    //Configure ETH_RMII_TXEN (PF8)
    GPIO_PinModeSet(gpioPortF, 8, gpioModePushPull, 0);
  
    //Configure ETH_RMII_RXD0 (PD9)
    GPIO_PinModeSet(gpioPortD, 9, gpioModeInput, 0);
  
    //Configure ETH_RMII_RXD1 (PF9)
    GPIO_PinModeSet(gpioPortF, 9, gpioModeInput, 0);
  
    //Configure ETH_RMII_CRSDV (PD11)
    GPIO_PinModeSet(gpioPortD, 11, gpioModeInput, 0);
  
    //Configure ETH_RMII_RXER (PD12)
    GPIO_PinModeSet(gpioPortD, 12, gpioModeInput, 0);
  
    //Configure ETH_MDIO (PD13)
    GPIO_PinModeSet(gpioPortD, 13, gpioModePushPull, 0);
  
    //Configure ETH_MDC (PD14)
    GPIO_PinModeSet(gpioPortD, 14, gpioModePushPull, 0);
  
    //Remap RMII pins
    ETH->ROUTELOC1 = (ETH->ROUTELOC1 & ~(_ETH_ROUTELOC1_RMIILOC_MASK & _ETH_ROUTELOC1_MDIOLOC_MASK)) | (ETH_ROUTELOC1_RMIILOC_LOC1 | ETH_ROUTELOC1_MDIOLOC_LOC1);
  
    //Enable RMII pins
    ETH->ROUTEPEN  = ETH_ROUTEPEN_RMIIPEN | ETH_ROUTEPEN_MDIOPEN;
  
    //Configure ETH_PWR_ENABLE (PI10)
    GPIO_PinModeSet(gpioPortI, 10, gpioModePushPull, 0);
    //Configure ETH_RESET_N (PH7)
    GPIO_PinModeSet(gpioPortH, 7, gpioModePushPull, 0);
    //Configure ETH_INTRP (PG15)
    GPIO_PinModeSet(gpioPortG, 15, gpioModeInput, 0);
  
    //Power on PHY transceiver
    GPIO_PinOutSet(gpioPortI, 10);
    tx_thread_sleep(10);
  
