bdrr77/azurertos-efx32/netxduo_port/nx_driver_efm32gg11b.c
    //Reset PHY transceiver (hard reset)
    GPIO_PinOutClear(gpioPortH, 7);
    tx_thread_sleep(10);
    GPIO_PinOutSet(gpioPortH, 7);
    tx_thread_sleep(10);

    //Configure MDC clock speed
    ETH->NETWORKCFG = (4 << _ETH_NETWORKCFG_MDCCLKDIV_SHIFT) &
       _ETH_NETWORKCFG_MDCCLKDIV_MASK;
  
    //Enable management port (MDC and MDIO)
    ETH->NETWORKCTRL |= _ETH_NETWORKCTRL_MANPORTEN_MASK;

    //Set the MAC address of the station
    ETH->SPECADDR1BOTTOM    =   *((uint32_t *)(&_nx_driver_hardware_address[0]));
    ETH->SPECADDR1TOP       =   *((uint16_t *)(&_nx_driver_hardware_address[4]));
  
    //The MAC supports 3 additional addresses for unicast perfect filtering
    ETH->SPECADDR2BOTTOM = 0;
    ETH->SPECADDR3BOTTOM = 0;
    ETH->SPECADDR4BOTTOM = 0;
  
    //Initialize hash table
    ETH->HASHBOTTOM = 0;
    ETH->HASHTOP = 0;
  
    //Configure the receive filter
    ETH->NETWORKCFG |= _ETH_NETWORKCFG_RX1536BYTEFRAMES_MASK |
       _ETH_NETWORKCFG_MULTICASTHASHEN_MASK;
  
    //Initialize TX buffer descriptors
    for(i = 0; i < NX_DRIVER_TX_DESCRIPTORS; i++)
    {
        //Calculate the address of the current TX buffer
        address = (ULONG) nx_driver_information.nx_driver_information_transmit_packets[i];
        //Write the address to the descriptor entry
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].address = address;
        //Initialize status field
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].status = ETH_TX_USED;

        nx_driver_information.nx_driver_information_transmit_packets[i] = NX_NULL;

    }
  
    //Mark the last descriptor entry with the wrap flag
    nx_driver_information.nx_driver_information_dma_tx_descriptors[i - 1].status |= ETH_TX_WRAP;

    //Initialize RX buffer descriptors
    for(i = 0; i < NX_DRIVER_RX_DESCRIPTORS; i++)
    {
        /* Allocate a packet for the receive buffers.  */
        if (nx_packet_allocate(nx_driver_information.nx_driver_information_packet_pool_ptr, &packet_ptr, 
                               NX_RECEIVE_PACKET, NX_NO_WAIT) == NX_SUCCESS)
        {
            
            /* Adjust the packet.  */
            packet_ptr -> nx_packet_prepend_ptr += 2;
            address = (uint32_t) packet_ptr -> nx_packet_prepend_ptr;
            
            //Write the address to the descriptor entry
            nx_driver_information.nx_driver_information_dma_rx_descriptors[i].address = address & ETH_RX_ADDRESS;

            /* Remember the receive packet poitner.  */
            nx_driver_information.nx_driver_information_receive_packets[i] =  packet_ptr;

            /* Set Own bit of the RX descriptor Status.  */
            nx_driver_information.nx_driver_information_dma_rx_descriptors[i].status = ETH_RX_OWNERSHIP;
        }
        else
        {

            /* Cannot allocate packets from the packet pool. */
            return(NX_DRIVER_ERROR);
        }

    }
  
    //Mark the last descriptor entry with the wrap flag
    nx_driver_information.nx_driver_information_dma_rx_descriptors[i - 1].address |= ETH_RX_WRAP;

    /* Save the size of one rx buffer.  */
    nx_driver_information.nx_driver_information_rx_buffer_size = packet_ptr -> nx_packet_data_end - packet_ptr -> nx_packet_data_start;
        
    /* Clear the number of buffers in use counter.  */
    nx_driver_information.nx_driver_information_multicast_count = 0;
  
    //Start location of the TX descriptor list
    ETH->TXQPTR = (ULONG) nx_driver_information.nx_driver_information_dma_tx_descriptors;
    //Start location of the RX descriptor list
    ETH->RXQPTR = (ULONG) nx_driver_information.nx_driver_information_dma_rx_descriptors;

    //Clear transmit status register
    ETH->TXSTATUS = _ETH_TXSTATUS_TXUNDERRUN_MASK |
       _ETH_TXSTATUS_TXCMPLT_MASK | _ETH_TXSTATUS_AMBAERR_MASK |
       _ETH_TXSTATUS_TXGO_MASK | _ETH_TXSTATUS_RETRYLMTEXCD_MASK |
       _ETH_TXSTATUS_COLOCCRD_MASK | _ETH_TXSTATUS_USEDBITREAD_MASK;
  
    //Clear receive status register
    ETH->RXSTATUS = _ETH_RXSTATUS_RXOVERRUN_MASK | _ETH_RXSTATUS_FRMRX_MASK |
       _ETH_RXSTATUS_BUFFNOTAVAIL_MASK;
  
    //First disable all interrupts
    ETH->IENC = 0xFFFFFFFF;
  
    //Only the desired ones are enabled
    ETH->IENS = _ETH_IENS_RXOVERRUN_MASK |
       _ETH_IENS_TXCMPLT_MASK | _ETH_IENS_AMBAERR_MASK |
       _ETH_IENS_RTRYLMTORLATECOL_MASK | _ETH_IENS_TXUNDERRUN_MASK |
       _ETH_IENS_RXUSEDBITREAD_MASK | _ETH_IENS_RXCMPLT_MASK;
  
    //Read ETH_IFCR register to clear any pending interrupt
    ETH->IFCR;
  
    // //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
    // NVIC_SetPriorityGrouping(EFM32GG11_ETH_IRQ_PRIORITY_GROUPING);
  
    // //Configure Ethernet interrupt priority
    // NVIC_SetPriority(ETH_IRQn, NVIC_EncodePriority(EFM32GG11_ETH_IRQ_PRIORITY_GROUPING,
    //    EFM32GG11_ETH_IRQ_GROUP_PRIORITY, EFM32GG11_ETH_IRQ_SUB_PRIORITY));
  
    //Enable the transmitter and the receiver
    ETH->NETWORKCTRL |= _ETH_NETWORKCTRL_ENBTX_MASK | _ETH_NETWORKCTRL_ENBRX_MASK;

    /* Return success!  */
    return(NX_SUCCESS);
} 


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_enable                        STM32F7xx/IAR     */ 
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific link enable requests.     */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    driver_req_ptr                        Driver request pointer        */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    ETH_Start                             Start Ethernet operation      */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    _nx_driver_enable                     Driver link enable processing */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
static UINT  _nx_driver_hardware_enable(NX_IP_DRIVER *driver_req_ptr)
{

    //Clear transmit status register
    ETH->TXSTATUS = _ETH_TXSTATUS_TXUNDERRUN_MASK |
       _ETH_TXSTATUS_TXCMPLT_MASK | _ETH_TXSTATUS_AMBAERR_MASK |
       _ETH_TXSTATUS_TXGO_MASK | _ETH_TXSTATUS_RETRYLMTEXCD_MASK |
       _ETH_TXSTATUS_COLOCCRD_MASK | _ETH_TXSTATUS_USEDBITREAD_MASK;
  
    //Clear receive status register
    ETH->RXSTATUS = _ETH_RXSTATUS_RXOVERRUN_MASK | _ETH_RXSTATUS_FRMRX_MASK |
       _ETH_RXSTATUS_BUFFNOTAVAIL_MASK;
  
    //First disable all interrupts
    ETH->IENC = 0xFFFFFFFF;
  
    //Only the desired ones are enabled
    ETH->IENS = _ETH_IENS_RXOVERRUN_MASK |
       _ETH_IENS_TXCMPLT_MASK | _ETH_IENS_AMBAERR_MASK |
       _ETH_IENS_RTRYLMTORLATECOL_MASK | _ETH_IENS_TXUNDERRUN_MASK |
       _ETH_IENS_RXUSEDBITREAD_MASK | _ETH_IENS_RXCMPLT_MASK;
  
    //Read ETH_IFCR register to clear any pending interrupt
    ETH->IFCR;

    //Enable the transmitter and the receiver
    ETH->NETWORKCTRL |= _ETH_NETWORKCTRL_ENBTX_MASK | _ETH_NETWORKCTRL_ENBRX_MASK;

    /* Return success!  */
    return(NX_SUCCESS);
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_disable                       STM32F7xx/IAR     */ 
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific link disable requests.    */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    driver_req_ptr                        Driver request pointer        */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    ETH_MACTransmissionCmd                Disable transmit              */ 
/*    ETH_FlushTransmitFIFO                 Flush transmit FIFO           */ 
/*    ETH_MACReceptionCmd                   Disable receive               */ 
/*    ETH_DMATransmissionCmd                Stop DMA transmission         */ 
/*    ETH_DMAReceptionCmd                   Stop DMA reception            */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    _nx_driver_disable                    Driver link disable processing*/ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
static UINT  _nx_driver_hardware_disable(NX_IP_DRIVER *driver_req_ptr)
{

    //Disable the transmitter and the receiver
    ETH->NETWORKCTRL &= ~(_ETH_NETWORKCTRL_ENBTX_MASK | _ETH_NETWORKCTRL_ENBRX_MASK);

    /* Return success!  */
    return(NX_SUCCESS);
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_packet_send                   STM32F7xx/IAR     */ 
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific packet send requests.     */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    packet_ptr                            Pointer to packet to send     */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    [_nx_driver_transmit_packet_enqueue]  Optional internal transmit    */ 
/*                                            packet queue routine        */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    _nx_driver_packet_send                Driver packet send processing */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
static UINT  _nx_driver_hardware_packet_send(NX_PACKET *packet_ptr)
{

ULONG           curIdx;
NX_PACKET       *pktIdx;
ULONG           bd_count = 0;
uint32_t        bufferSize;
TX_INTERRUPT_SAVE_AREA


    /* Pick up the first BD. */
    curIdx = nx_driver_information.nx_driver_information_transmit_current_index;

    /* Check if it is a free descriptor.  */
    if ((nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].status & ETH_TX_USED) || nx_driver_information.nx_driver_information_transmit_packets[curIdx])
    {
        
