bdrr77/azurertos-efx32/netxduo_port/nx_driver_efm32gg11b.c
                    temp_idx = (idx - 1) & (NX_DRIVER_RX_DESCRIPTORS - 1);
                    nx_driver_information.nx_driver_information_receive_packets[temp_idx] -> nx_packet_next = NX_NULL;
                    nx_driver_information.nx_driver_information_receive_packets[temp_idx] -> nx_packet_append_ptr -= nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_prepend_ptr >= nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_append_ptr;
                    nx_driver_information.nx_driver_information_dma_rx_descriptors[idx].status = ETH_RX_OWNERSHIP;
                    nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_prepend_ptr = nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_data_start + 2;
                    bd_count--;
                }
            }
            
            /* Allocate new NX_PACKETs for BDs.  */
            for (i = bd_count; i >= 0; i--)
            {
                
                temp_idx = (first_idx + i) & (NX_DRIVER_RX_DESCRIPTORS - 1);
                
                /* Allocate a new packet from the packet pool.  */
                if (nx_packet_allocate(nx_driver_information.nx_driver_information_packet_pool_ptr, &packet_ptr, 
                                          NX_RECEIVE_PACKET, NX_NO_WAIT) == NX_SUCCESS)
                {
                    
                    /* Adjust the new packet and assign it to the BD.  */
                    packet_ptr -> nx_packet_prepend_ptr += 2;
                    nx_driver_information.nx_driver_information_dma_rx_descriptors[temp_idx].address = (ULONG)packet_ptr->nx_packet_prepend_ptr;
                    nx_driver_information.nx_driver_information_dma_rx_descriptors[temp_idx].status = ETH_RX_OWNERSHIP;
                    nx_driver_information.nx_driver_information_receive_packets[temp_idx] = packet_ptr;
                    
                      
                }
                else
                {
                    
                    /* Allocation failed, get out of the loop.  */
                    break;
                }
            }
            
            if (i >= 0)
            {
                
                /* At least one packet allocation was failed, release the received packet.  */
                nx_packet_release(nx_driver_information.nx_driver_information_receive_packets[temp_idx] -> nx_packet_next);
                
                for (; i >= 0; i--)
                {
                    
                    /* Free up the BD to ready state. */
                    temp_idx = (first_idx + i) & (NX_DRIVER_RX_DESCRIPTORS - 1);
                    nx_driver_information.nx_driver_information_dma_rx_descriptors[temp_idx].status = ETH_RX_OWNERSHIP;
                    nx_driver_information.nx_driver_information_receive_packets[temp_idx] -> nx_packet_prepend_ptr = nx_driver_information.nx_driver_information_receive_packets[temp_idx] -> nx_packet_data_start + 2;
                }
            }
            else
            {
                
                /* Everything is OK, transfer the packet to NetX.  */
                _nx_driver_transfer_to_netx(nx_driver_information.nx_driver_information_ip_ptr, received_packet_ptr);
            }
            
            /* Set the first BD index for the next packet.  */
            first_idx = (idx + 1) & (NX_DRIVER_RX_DESCRIPTORS - 1);
            
            /* Update the current receive index.  */
            nx_driver_information.nx_driver_information_receive_current_index = first_idx;
            
            received_packet_ptr = nx_driver_information.nx_driver_information_receive_packets[first_idx];
            
            bd_count = 0;

        }
        else
        {
            
            /* This BD is not the last BD of a frame. It is a intermediate descriptor.  */
            
            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_next = nx_driver_information.nx_driver_information_receive_packets[(idx + 1) & (NX_DRIVER_RX_DESCRIPTORS - 1)];
            
            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_append_ptr = nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_data_end;
            
            if (idx != first_idx)
            {
                
                nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_prepend_ptr = nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_data_start;
            }
            
            bd_count++;
        }
    }
    
    /* If Rx DMA is in suspended state, resume it.  */

}


#ifdef NX_ENABLE_INTERFACE_CAPABILITY
/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_capability_set                STM32F7xx/IAR     */  
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific capability set requests.  */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    driver_req_ptr                         Driver request pointer       */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    _nx_driver_capability_set             Capability set processing     */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
static UINT _nx_driver_hardware_capability_set(NX_IP_DRIVER *driver_req_ptr)
{
    
    return NX_SUCCESS;
}
#endif /* NX_ENABLE_INTERFACE_CAPABILITY */


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_driver_stm32f7xx_ethernet_isr                  STM32F7xx/IAR     */ 
/*                                                           6.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processing incoming packets.  This routine is         */
/*    be called from the receive packet ISR and assumes that the          */ 
/*    interrupt is saved/restored around the call by ThreadX.             */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    None                                                                */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    None                                                                */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    _nx_ip_driver_deferred_processing     IP receive packet processing  */ 
/*    ETH_DMAClearITPendingBit              Ethernet DMA Interrupt clear  */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    ISR                                                                 */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
VOID  nx_driver_efm32gg11b_ethernet_isr(VOID)
{

volatile uint32_t isr;
volatile uint32_t tsr;
volatile uint32_t rsr;

#ifdef NX_DRIVER_ENABLE_DEFERRED
ULONG deffered_events;
#endif /* NX_DRIVER_ENABLE_DEFERRED */

    //Each time the software reads ETH_IFCR, it has to check the contents
    //of ETH_TXSTATUS, ETH_RXSTATUS and ETH_NETWORKSTATUS
    isr = ETH->IFCR;
    tsr = ETH->TXSTATUS;
    rsr = ETH->RXSTATUS;

    //Clear interrupt flags
    ETH->IFCR = isr;

#ifdef NX_DRIVER_ENABLE_DEFERRED
    deffered_events = nx_driver_information.nx_driver_information_deferred_events;
#endif /* NX_DRIVER_ENABLE_DEFERRED */



    //Packet transmitted?
    if((tsr & (_ETH_TXSTATUS_TXUNDERRUN_MASK |
        _ETH_TXSTATUS_TXCMPLT_MASK | _ETH_TXSTATUS_AMBAERR_MASK |
        _ETH_TXSTATUS_TXGO_MASK | _ETH_TXSTATUS_RETRYLMTEXCD_MASK |
        _ETH_TXSTATUS_COLOCCRD_MASK | _ETH_TXSTATUS_USEDBITREAD_MASK)) != 0)
    {
        //Only clear TXSTATUS flags that are currently set
        ETH->TXSTATUS = tsr;

#ifdef NX_DRIVER_ENABLE_DEFERRED

        /* Set the transmit complete bit.  */
        nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_TRANSMITTED;
#else

        /* Process transmitted packet(s).  */
        _nx_driver_hardware_packet_transmitted();
#endif /* NX_DRIVER_ENABLE_DEFERRED */

    }


   //Packet received?
   if((rsr & (_ETH_RXSTATUS_RXOVERRUN_MASK | _ETH_RXSTATUS_FRMRX_MASK |
      _ETH_RXSTATUS_BUFFNOTAVAIL_MASK)) != 0)
   {
#ifdef NX_DRIVER_ENABLE_DEFERRED

        /* Set the receive packet interrupt.  */
        nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_RECEIVED;
#else

        /* Process received packet(s).  */
        _nx_driver_hardware_packet_received();
#endif /* NX_DRIVER_ENABLE_DEFERRED */
   }


#ifdef NX_DRIVER_ENABLE_DEFERRED
    if (!deffered_events)
    {
        
        /* Call NetX deferred driver processing.  */        
        _nx_ip_driver_deferred_processing(nx_driver_information.nx_driver_information_ip_ptr);
    }
#endif /* NX_DRIVER_ENABLE_DEFERRED */

}


/****** DRIVER SPECIFIC ****** Start of part/vendor specific internal driver functions.  */

